app/views/home/_tweet.html.erb

		<div class="actions">
		<%= link_to tweet.like_string(current_user.id), url_for(controller: 'likes', action: 'toggle_like', tweet_id: tweet.id), method: :post,id: "like_#{tweet.id}" ,remote: true %> , <li id=<%="likes_count_#{tweet.id}"%>><%= tweet.likes.count %></li>
		</div>
		<% current_reaction = Reaction.where(user_id: current_user.id,tweet_id: tweet.id).first %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."tweet_id" = ? AND "likes"."user_id" = ?  [["tweet_id", 1], ["user_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 1]]
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."user_id" = ? AND "reactions"."tweet_id" = ?  ORDER BY "reactions"."id" ASC LIMIT 1  [["user_id", 1], ["tweet_id", 19]]