app/controllers/likes_controller.rb

	def toggle_like
		@tweet = Tweet.find(params[:tweet_id])
		like = Like.where(user: current_user, tweet: @tweet).first
		# @count_of_likes = tweet.likes.count.to_i ;
		if like
			like.destroy!
			@is_liked = false
			# @count_of_likes = @count_of_likes -1
		else
			Like.create(user: current_user, tweet: @tweet)
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 15]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = 2 AND "likes"."tweet_id" = 15  ORDER BY "likes"."id" ASC LIMIT 1
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 4]]
INSERT INTO "likes" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["tweet_id", 15], ["created_at", "2017-07-12 15:51:49.494355"], ["updated_at", "2017-07-12 15:51:49.494355"]]