app/controllers/tweets_controller.rb

  def deltweet
    @tweet_id = params[:tweet_id]
    tweet  = Tweet.find(params[:tweet_id])
    @message = false;
    if tweet.user_id == current_user.id
      tweet.destroy
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 3]]

  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user_id = current_user.id
    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello1"], ["user_id", 1], ["created_at", "2017-07-12 11:25:32.330706"], ["updated_at", "2017-07-12 11:25:32.330706"]]